#include <iostream> 
using namespace std;
//Анекдот: Согласно народной примете, в новый дом первым нужно впускать интернет-кабель. И где он ляжет - там ставьте кровать. И стол. И комп. И жрачку.
int main() {
	setlocale(LC_ALL, "rus"); //Поддержка русского языка в консоли
	int a1, b1, c1, a2, b2, c2; // переменные 
	cout << "Input A1 B1 C1 A2 B2 C2: ";
	cin >> a1 >> b1 >> c1 >> a2 >> b2 >> c2; //ввод
	if (a1 == 0) {
		if (b1 == 0) {
			if ((a2 == 0 && b2 == 0)) { 
				cout << "не прямые"; //Случай . .
			}
			else
				cout << "1 ур-ие - не прямая"; //Случай . /
		}
		else {
			if (a2 == a1) {
				if (b2 == 0) {
					cout << "2 ур-ие - не прямая"; //Случай / .
				}
				else {
					if (((b1 / (b2 * 1.0f)) == (c1 / (c2 * 1.0f))) || ((b2 / (b1 * 1.0f)) == (c2 / (c1 * 1.0f))))
						cout << "совпадают"; //Случай _ _
					else
						cout << "параллельны"; //Случай =
				}
			}
			else
				cout << "пересекаются " << ((-c1) * b2 - (-c2) * b1) / (a1 * b2 - b1 * a2 * 1.0f) << ", " << (a1 * (-c2) - (-c1) * a2) / (a1 * b2 - b1 * a2 * 1.0f); //Случай _ / (|) + нахождение x y по методу матриц
		}
	}
	else {
		if (b1 == 0) {
			if (b2 == 0) {
				if (a2 == 0) {
					cout << "2 ур-ие - не прямая"; //Случай | .
				}
				else {
					if (((a1 / (a2 * 1.0f)) == (c1 / (c2 * 1.0f))) || ((a2 / (a1 * 1.0f)) == (c2 / (c1 * 1.0f)))) {
						cout << "совпадают"; //Случай |
					}
					else
						cout << "параллельны"; //Случай | |
				}
			}
			else cout << "пересекаются " << ((-c1) * b2 - (-c2) * b1) / (a1 * b2 - b1 * a2 * 1.0f) << ", " << (a1 * (-c2) - (-c1) * a2) / (a1 * b2 - b1 * a2 * 1.0f); //Случай | / + матрицы
		}
		else {
			if (a2 == 0) {
				if (b2 == 0) {
					cout << "2 ур-ие - не прямая"; //Случай / .
				}
				else cout << "пересекаются " << ((-c1) * b2 - (-c2) * b1) / (a1 * b2 - b1 * a2 * 1.0f) << ", " << (a1 * (-c2) - (-c1) * a2) / (a1 * b2 - b1 * a2 * 1.0f); //Случай / _ + матрицы
			}
			else {
				if (b2 == 0) {
					cout << "пересекаются " << ((-c1) * b2 - (-c2) * b1) / (a1 * b2 - b1 * a2 * 1.0f) << ", " << (a1 * (-c2) - (-c1) * a2) / (a1 * b2 - b1 * a2 * 1.0f); //Случай / | + матрицы
				}
				else {
					if (((a1 / (b1 * 1.0f)) == (a2 / (b2 * 1.0f))) || ((b1 / (a1 * 1.0f)) == (b2 / (a2 * 1.0f)))) {
						if ((((a1 / (a2 * 1.0f)) == (b1 / (b2 * 1.0f))) && ((a1 / (a2 * 1.0f)) == (c1 / (c2 * 1.0f)))) || (((a2 / (a1 * 1.0f)) == (b2 / (b1 * 1.0f))) && ((a2 / (a1 * 1.0f)) == (c2 / (c1 * 1.0f))))) {
							cout << "совпадают"; //Случай /
						}
						else cout << "параллельны"; //Случай / /
					}
					else cout << "пересекаются " << ((-c1) * b2 - (-c2) * b1) / (a1 * b2 - b1 * a2 * 1.0f) << ", " << (a1 * (-c2) - (-c1) * a2) / (a1 * b2 - b1 * a2 * 1.0f); //Случай / \ + матрицы
				}
			}
		}
	}
	return 0;
}